Dict={"机战王":
{"洛洛":
{"时光之城":
{"霹雳火":{"绝技":"雷霆半月斩","合击绝技":
{"与急先锋克猛虎王":"流影电光闪","高级":"月色血风暴"}}},
"月神殿":
{"急先锋":{"绝技":"惊天浪涛杀","合击绝技":
{"与霹雳火克猛虎王":"流影电光闪","高级":"月色血风暴"}}},
"风雪之城":
{"超音速":{"绝技":"破空寒冰砍","合击绝技":
{"与龙卷风克暴龙神":"天羽屠龙舞"}}},
"能源之城":
{"龙卷风":{"绝技":"闪电旋风劈","合击绝技":
{"与超音速克暴龙神":"天羽屠龙舞"}}}}}}
Game_name=input("请输入游戏名：")
if Game_name in Dict:
	God_name=input("请选择机战王：")
	if God_name in Dict["机战王"]:
		City_name=input("请选择城池：")
		if City_name in Dict["机战王"]["洛洛"]:
			Player_name=input("请选择玩家：")
			if Player_name in Dict["机战王"]["洛洛"]["时光之城"]:
				print(Dict["机战王"]["洛洛"]["时光之城"])
			elif Player_name in Dict["机战王"]["洛洛"]["月神殿"]:
				print(Dict["机战王"]["洛洛"]["月神殿"])
			elif Player_name in Dict["机战王"]["洛洛"]["风雪之城"]:
				print(Dict["机战王"]["洛洛"]["风雪之城"])
			elif Player_name in Dict["机战王"]["洛洛"]["能源之城"]:
				print(Dict["机战王"]["洛洛"]["能源之城"])
		


